# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Estrutura de um Programa em C}
#+latex: \mytitleslide

* Ilustração do tamanho do campo e precisão

#+latex_attr: :options :fontsize \tiny
#+BEGIN_SRC C :tangle e/teste-printf.c
//teste saida printf
#include <stdio.h>
int main( )
{
  float valor=99.7567892;
  printf("Valor com 9f   = [%9f]\n", valor);
  printf("Valor com 9.0f = [%9.0f]\n", valor);
  printf("Valor com 9.1f = [%9.1f]\n", valor);
  printf("Valor com 9.2f = [%9.2f]\n", valor);
  printf("Valor com 9.3f = [%9.3f]\n", valor);
  printf("Valor com 1.2f = [%1.2f]\n", valor);
  return 0;
}
#+END_SRC

#+latex: \vfill\pause

Compilando e executando (veja a saída também no terminal)

#+begin_src shell :results output :dir e :exports both
gcc teste-printf.c -o teste-printf
./teste-printf
#+end_src

#+RESULTS:
: Valor com 9f   = [99.756790]
: Valor com 9.0f = [      100]
: Valor com 9.1f = [     99.8]
: Valor com 9.2f = [    99.76]
: Valor com 9.3f = [   99.757]
: Valor com 1.2f = [99.76]

* Emacs setup                                                      :noexport:

#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-packages-alist '("" "minted"))
(setq org-latex-listings 'minted)
(setq org-latex-minted-options '(("style" "Tango") ("bgcolor" "white") ("frame" "lines") ("linenos" "false") ("fontsize" "\\small")))
(setq org-latex-pdf-process '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+END_SRC

#+RESULTS:
| pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f |
